gcc -g p1original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x822: file p1original.c, line 25.
(gdb) r
Starting program: /home/runner/ppa-IA2-practice2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:25
25  {
(gdb) n
27  input(&b,&h);
(gdb) s
input (b=0x7fffc715005c, h=0x7fffc7150060) at p1original.c:13
13    printf("Enter the base and height of triangle\n");
(gdb) n
Enter the base and height of triangle
14    scanf("%f%f",b,h);
(gdb) n
1 2
15  }
(gdb) p *b
$1 = 1
(gdb) p *h
$2 = 2
(gdb) n
main () at p1original.c:28
28  find_area(b,h,&a);
(gdb) s
find_area (b=1, h=2, a=0x7fffc7150064) at p1original.c:18
18    *a= 0.5*b*h;
(gdb) n
19  }
(gdb) p *a
$3 = 1
(gdb) n
main () at p1original.c:29
29  output(b,h,a);
(gdb) s
output (b=1, h=2, a=1) at p1original.c:22
22    printf("The area of the traingle with base %f and height %f is %f\n",b,h,a);
(gdb) n
The area of the traingle with base 1.000000 and height 2.000000 is 1.000000
23  }
(gdb) n
main () at p1original.c:30
30  return 0;
(gdb) c
Continuing.
[Inferior 1 (process 189) exited normally]
(gdb) 
